# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 12 # number of classes
depth_multiple: 1 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors: 3

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 3, 2, 1]], # 0
    [-1, 1, C3, [64]],
    [-1, 1, Conv, [128, 3, 2, 1]], # 2
    [-1, 1, C3, [128]],
    [-1, 1, Conv, [256, 3, 2, 1]], # 4
    [-1, 1, C3, [256]],
    [-1, 1, Conv, [512, 3, 2, 1]], # 6
    [-1, 1, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2, 1]], # 8
    [-1, 1, C3, [1024]],
    [-1, 1, SPPF, [1024, 3]], # 10
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 3, 1, 1]], #11
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 7], 1, Concat, [1]], # cat backbone P4
    [-1, 1, C3, [512, False]], # 14

    [-1, 1, Conv, [256, 3, 1, 1]], # 15
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 5], 1, Concat, [1]], # cat backbone P3
    [-1, 1, C3, [256, False]], # 18 (P3/8-small)

    [-1, 1, Conv, [128, 3, 1, 1]], # 19
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 3], 1, Concat, [1]], # cat backbone P3
    [-1, 1, C3, [128, False]], # 22 (P3/8-small)

    [-1, 1, Conv, [64, 3, 1, 1]], # 23
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 1], 1, Concat, [1]], # cat backbone P3
    [-1, 1, C3, [64, False]], # 26 (P3/8-small)

    [[14, 18, 22, 26], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
